Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: འཇམ་དཔལ་གྱི་ཡེ་ཤེས་རྒྱ་མཚོ་ལས་བྱུང་བའི་ཡོན་ཏན་གྱི་འབྱུང་གནས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཐོབ་པར་བྱ་བ་ལ་མངོན་དུ་བལྟས་པ།
en: you who are the source of a lotus of good qualities, arising from the ocean of the wisdom of Mañjuśrī; you who are focused on attaining the blessing of the buddhas;

source: ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་དང་ཤུགས་རབ་ཏུ་ཐོབ་པ།
en: you who have attained the light and power of samādhi;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་དག་པར་གཟུང་བ་ལ་མངོན་པར་མོས་པའི་སེམས་དང་ལྡན་པ།
en: you who aspire to obtain the rain from the clouds of Dharma of all the buddhas;

source: སངས་རྒྱས་མཐོང་བས་དགའ་བ་དང་། མོས་པའི་ཤུགས་ཀྱིས་ཡིད་རབ་ཏུ་བདེ་བར་གྱུར་པ།
en: you whose mind is made happy by the power of faith and delight on seeing the buddhas;

source: ལེགས་པར་སྤྱོད་པ་ཚད་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པའི་ཤུགས་ཀྱིས་མངོན་པར་བརླན་པའི་སེམས་དང་ལྡན་པ།
en: you whose mind is moistened by the power of immeasurable, inconceivable conduct;

source: ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བའི་ཤུགས་ཀྱིས་རྣམ་པར་དག་པའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་མཛོད་བདག་ལ་མངོན་དུ་གྱུར་པ།
en: you who have become the lord of a treasure of pure merit and wisdom through the power of the practice of good qualities;

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མཐོང་བའི་ལམ་གྱི་ཤུགས་གཞན་ལ་ཡོངས་སུ་བསྟན་པའི་བསམ་པ་ཅན།
en: you who are motivated to teach others the power of the path to seeing omniscient wisdom;

source: སྙིང་རྗེ་ཆེན་པོའི་ཤུགས་མ་ཉམས་པའི་རྩ་བ་དང་ལྡན་པ།
en: you who possess the root that is the undiminishing power of great compassion;

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བའི་ཤུགས་ཡང་དག་པར་གཟུང་བའི་བློ་གྲོས་ཅན་ཁྱོད་འོངས་པ་ལེགས་སོ་ལེགས་སོ།
en: you who are intent on possessing the power of the light of the wisdom of the tathāgatas.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་གདན་པ་དེར་སོང་ནས།
en: Then Sudhana, the head merchant’s son, approached the bodhisattva Avalokiteśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: He bowed his head to the feet of the bodhisattva Avalokiteśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: He circumambulated the bodhisattva Avalokiteśvara many hundreds of thousands of times, keeping him to his right.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Then he stood before him and, with his hands placed together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་མདོག་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ་འོད་ཀྱི་དྲ་བ་རྣམ་པ་སྣ་ཚོགས་ཚད་མེད་པ་འཕྲོ་བའི་རྒྱན་གྱི་སྤྲིན་རབ་ཏུ་འགྱེད་པའི་ལག་པ་གཡས་པ་བརྐྱང་ཏེ། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ལས་བྱུང་བའི་འོད་གཟེར་སྣ་ཚོགས་དྲི་མ་མེད་པ། ལུས་དང་སེམས་ཀྱི་བདེ་བ་ཚད་མེད་པ་རབ་ཏུ་སྐྱེད་པའི་ཚོགས་ཀྱིས་ཤིན་ཏུ་རྒྱས་པའི་ལག་པ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོ་ལ་བཞག་སྟེ།
en: Then the bodhisattva Avalokiteśvara extended his right hand, which was the color of gold from the Jambu River and emanated a display of clouds of countless networks of lights of various colors, and upon Sudhana’s head he placed his hand, which had the multicolored light rays that shine from the signs and features of a great being and bring stainless, measureless physical and mental bliss.

source: འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: The bodhisattva Avalokiteśvara said, “Noble one, it is excellent, excellent, that you have in that way developed the aspiration for the highest, complete enlightenment!

source: །རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་ཤེས་ཏེ།
en: “Noble one, I know the gateway to bodhisattva activity called the unimpeded gateway to great compassion

source: རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་དེ་ནི་འགྲོ་བ་ཐམས་ཅད་ལ་དབྱེ་བ་མེད་པར་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་ཞུགས་པ་སྒོ་ཀུན་ནས་ཐོས་ཤིང་རྣམ་པར་རིག་པར་འགྱུར་བས། སེམས་ཅན་ཡོངས་སུ་བསྡུ་བ་དང་། གདུལ་བ་ལ་ཉེ་བར་གནས་པ་སྟེ།
en: “Noble one, my gateway to bodhisattva activity called the unimpeded gateway to great compassion ripens and guides beings without making any distinctions among all beings, and it gathers and guides beings through their completely hearing and knowing this gateway.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་ལ་གནས་པས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ནས་ཀྱང་མི་གཡོ་ལ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགོས་པ་ལའང་སྟ་གོན་དུ་གནས་ཏེ།
en: “Noble one, in that way, being established in the gateway to bodhisattva activity called the unimpeded gateway to great compassion , though I never depart from being at the feet of all the tathāgatas, I remain focused on what should be done for all beings.

source: སྦྱིན་པས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྡུད་དོ།
en: I gather beings through generosity.

source: །ངག་སྙན་པ་དང་དོན་བྱ་བ་དང་། དོན་འཐུན་པས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་བསྡུད་དོ།
en: I gather beings through pleasant words, through benefiting them, and through practicing what I teach.

source: །གཟུགས་ཀྱི་ལུས་རྣམ་པར་བསྟན་པས་ཀྱང་།
en: “I also ripen beings through manifesting physical bodies.

source: སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱེད་དོ། །ཁ་དོག་དང་དབྱིབས་དང་གཟུགས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏེ། རྣམ་པར་དམིགས་པར་བྱ་བ་དང་། འོད་གཟེར་ཀྱི་དྲ་བ་དགྱེ་བས་ཀྱང་སེམས་ཅན་རབ་ཏུ་ཚིམ་པར་བྱེད་ཅིང་ཡོངས་སུ་སྨྱིན་པར་བྱེད་དོ།
en: I gladden and ripen beings through manifesting countless pure colors, shapes, and forms and through radiating a net of light rays. I speak to them in accordance with their aspirations.

source: །བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དབྱངས་བརྗོད་པ་དང་། ཅི་ལ་དགའ་བའི་སྤྱོད་ལམ་ཡོངས་སུ་བསྟན་པ་དང་། མོས་པ་སྣ་ཚོགས་དང་། ཚུལ་འཐུན་པར་ཆོས་བསྟན་པ་དང་། རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་། དགེ་བའི་ཆོས་བསྩགས་པར་བག་མྱི་བྱེད་པའི་སེམས་ཅན་གྱི་སེམས་ཡོངས་སུ་བསྐུལ་བ་དང་། བསམ་པ་དང་འཐུན་པར་སྤྲུལ་པ་སྣ་ཚོགས་ཚད་མེད་པ་ཡོངས་སུ་བསྟན་པ་དང་། རིགས་སྣ་ཚོགས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་དང་སྐལ་བ་འཐུན་པའི་གཟུག་ཡོངས་སུ་བསྟན་པ་དང་། གནས་གཅིག་ཏུ་འགྲོགས་པས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་བསྡུས་ཤིང་ཡོངས་སུ་སྨྱིན་པར་བྱེད་དོ།
en: I manifest whatever path of conduct they delight in. I teach them the Dharma in accordance with their various wishes. I manifest various forms of miracles so as to inspire beings who have not been attentive in accumulating virtuous qualities. I manifest a variety of countless emanations in accordance with their wishes. I gather and ripen beings by manifesting forms that accord with the states of the beings born in the various classes of existence and by living with them in the same place.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་འདི་ཡོངས་སུ་སྦྱངས་པས།
en: “Noble one, in that way I have purified the gateway to bodhisattva activity called the unimpeded gateway to great compassion and therefore prayed to be a support for all beings.

source: འགྲོ་བ་ཐམས་ཅད་རབ་ཏུ་རྟེན་པའི་སྨོན་ལམ་བསྐྱེད་དེ། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཡང་སའི་འཇིགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱུད་ཀྱི་འཇིགས་པ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མགོ་རྨོངས་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བཅིངས་པའི་འཇིགས་པ་ཡོངས་སུ་གཅད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྲོག་ལ་བབ་པར་མི་བདེ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡོ་བྱད་ཀྱིས་ཕོངས་པའི་འཇིག་པ་བསལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བ་མེད་པའི་འཇིགས་པ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གྲགས་པ་མེད་པའི་འཇིག་རྟེན་པ་ལས་ཡོངས་སུ་བཟླ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་འཇིགས་པ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་དུ་བག་ཚ་བའི་འཇིགས་པ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་འཆི་བའི་འཇིགས་པ་ལས་རྣམ་པར་བཟླ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངན་སོང་གི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་མུན་པས་ཉམ་ང་བ་ཕྱིར་མི་ལྡོག་པའི་སྣང་བས་གསལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་སྐལ་བ་མི་མཉམ་པ་དང་འགྲོགས་པའི་འཇིགས་པ་ཤིན་ཏུ་བསལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་པ་དང་བྲལ་བའི་འཇིགས་པ་དགག་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་སྡུག་པ་དང་། འགྲོགས་པའི་འཇིགས་པ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལུས་ལ་མི་བདེ་བའི་འཇིགས་པ་དང་བྲལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་སེམས་ལ་མི་བདེ་བའི་འཇིགས་པ་ལས་དགྲོལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་འཁྲུགས་པ་ལས་ཡོངས་སུ་བཟླ་བའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་རབ་ཏུ་རྟེན་པའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་འདི་བྱས་སོ།
en: I have accomplished the prayer to be a support for all beings in order that I end for all beings the fear of precipices, cause fears within all beings to cease, eliminate fear from confusion in all beings, eliminate in all beings the fear of being in bondage, dispel in all beings the fear of circumstances that cause loss of life, banish from all beings the fear of being deprived of material necessities, end in all beings the fear of being without a livelihood, dispel in all beings the fear of ill repute, dispel in all beings the fear of being in saṃsāra, cause the fear of timidity within an assembly to cease in all beings, cause all beings to transcend the fear of death, dispel in all beings the fear of the lower existences, shine the light of irreversibility upon those whose path has degenerated in great darkness, completely eliminate in all beings the fear of meeting misfortune, extinguish in all beings the fear of being apart from what is liked, eliminate in all beings the fear of having to be with what is disliked, separate all beings from the fear of physical torment, free all beings from mental torment, and cause all beings to transcend suffering, unhappiness, and disturbances.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཇིགས་པ་རྣམ་པར་ཞི་བར་བྱ་བའི་ཕྱིར་ཡང་འཇིག་རྟེན་དུ་རྗེས་སུ་དྲན་པའི་སྒོ་བྱིན་གྱིས་བརླབས་སོ།
en: “I manifest the gateway to mindfulness in all worlds in order to dispel fear in all beings.

source: །སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་དང་བྲལ་བར་བྱ་བའི་ཕྱིར། རང་གི་མྱིང་འཁོར་ལོ་ཡང་འཇིག་རྟེན་དུ་རྣམ་པར་དམིགས་པར་བྱས་སོ།
en: I have made the wheel of my name known in all worlds in order to free all beings from fear.

source: །དུས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བས་རྣམ་པར་དམྱིགས་པར་བྱ་བའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྣམ་པའི་བྱེ་བྲག་མཐའ་ཡས་པ་དང་མཉམ་པར་ངའི་ལུས་ཀྱང་བྱིན་གྱིས་བརླབས་སོ།
en: I miraculously manifest my body to be the same as the distinct forms of all endless beings in order to be perceived by beings at the appropriate times.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ནི་ཐབས་འདིས་སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་ལས་ཡོངས་སུ་བཀྲོལ་ཅིང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཐོབ་པར་བྱ་བའི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་ཕྱིར་མི་ལྡོག་པར་བྱེད་དོ།
en: “Noble one, through this method, I liberate all beings from fear and cause them to develop an irreversible aspiration for the highest, complete enlightenment so that they will attain all the Dharmas of the buddhas.

source: །རིགས་ཀྱི་བུ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་འདི་ཐོབ་པར་ཟད་ན། དེས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་རྣམས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ལ་རྣམ་པར་དག་པ།
en: “Noble one, I know this gateway to bodhisattva activity called the unimpeded gateway to great compassion , but how could I know the conduct or describe the qualities of the completely good bodhisattvas who have the pure domain of the prayers of all buddhas;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཁོང་དུ་ཆུད་པར་རྟོགས་པ།
en: who have realized the completely good conduct of bodhisattvas;

source: དགེ་བའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་རྒྱུན་མི་གཅོད་པའི་རྒྱུད་དང་ལྡན་པ།
en: who have an unbroken continuity of creating virtuous qualities;

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྒྱུད་ལ་རྟག་ཏུ་མཉམ་པར་གཞག་པ།
en: who are always resting in a continuity of the samādhi of all bodhisattvas;

source: བསྐལ་པ་ཐམས་ཅད་དུ་གནས་ཤིང་སྤྱོད་པ་ལས་ཕྱིར་མི་ལྡོག་པའི་རྒྱུད་དང་ལྡན་པ།
en: who have nonregressing conduct while residing in all kalpas;

source: དུས་གསུམ་ཐམས་ཅད་ཀྱི་ཚུལ་རྗེས་སུ་རྟོགས་པའི་རྒྱུད་དང་ལྡན་པ།
en: who have the continuous understanding of the ways of all three times;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཀློང་ཡོངས་སུ་འཁྱིལ་བའི་རྒྱུད་ལ་མཁས་པ།
en: who are skilled in the continuity of the turning of the cycle of all world realms;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་དགེ་བའི་སེམས་རྣམ་པར་ཞི་བར་བྱེད་པའི་རྒྱུད་དང་ལྡན་པ།
en: who have the continuity of ending nonvirtuous mentalities in all beings;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་སེམས་ཡོངས་སུ་འཕེལ་བའི་རྒྱུད་དང་ལྡན་པ།
en: who have a continuity of increasing the virtuous mentalities of all beings;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་རྒྱུད་ལས་ཕྱིར་མི་ལྡོག་པར་བྱེད་པའི་རྒྱུད་དང་ལྡན་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: and who have the continuity of countering the continuity of saṃsāra for all beings?”

source: དེ་ལ་འདི་སྐད་ཅེས་བྱའོ།
en: Concerning this it is said:

source: །གཡས་ཕྱོགས་བསྐོར་བ་བྱས་ཏེ་གུས་པར་བཀུར་བསྟོད་ནས།
en: Sudhana, who was self-disciplined, circumambulated,

source: །ནོར་བཟངས་ཤིན་ཏུ་དུལ་བ་ལྷོ་ཕྱོགས་རྒྱུད་དུ་སོང་།
en: Praised reverently, and departed on the southern road—

source: །སྤྱན་རས་གཟིགས་དབང་དྲང་སྲོང་སྙིང་རྗེ་རྣམ་སྤྱོད་པ། །རིན་ཆེན་རིའི་སུལ་ན་གནས་པར་དེས་ཀྱང་མཐོང་།
en: He saw, residing in a cleft in a precious mountain, Avalokiteśvara, a ṛṣi who abided in compassion. The wise one was seated in the center of a lotus on a lion throne

source: །རིན་ཆེན་སྣ་ཚོགས་རྡོ་རྗེའི་རི་ཡི་སྨན་ལྗོངས་ན།
en: On the side of the diamond mountain with various precious jewels.

source: །པདྨའི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་བརྟན་པར་འདུག ལྷ་དང་ལྷ་མིན་ཀླུ་དང་སྲིན་པོ་མིའམ་ཅི།
en: He was teaching the Dharma to the devas, asuras, nāgas,

source: །རྒྱལ་བའི་སྲས་ཀྱིས་བསྐོར་ཅིང་དེ་ལ་ཆོས་ཀྱང་སྟོན།
en: Kinnaras, rākṣasas, and bodhisattvas who encircled him.

source: །མཐོང་ནས་ནོར་བཟངས་དགའ་བ་ཚད་མེད་སྐྱེས་པར་གྱུར།
en: When Sudhana saw him, he was filled with unequaled joy,

source: །བསྙེན་ཏེ་ཡོན་ཏན་རྒྱ་མཚོའི་རྐང་ལ་ཕྱག་འཚལ་ནས། །ཅི་ནས་བཟང་པོའི་སྤྱོད་པ་བདག་གིས་ཐོབ་འགྱུར་བར།
en: Approached him, and bowed down to the feet of the ocean of qualities.

source: །འཕགས་པས་ཐུགས་རྗེ་བསྐྱེད་དེ་གདམས་ཤིང་བསླབ་པར་གསོལ།
en: He said, “Ārya, have compassion and teach to me the training So that I may attain good conduct.”

source: །བསོད་ནམས་བརྒྱ་པས་བརྒྱན་པའི་དྲི་མེད་ལག་བརྐྱང་སྟེ།
en: Extending his stainless hand, adorned by a hundred merits,

source: །འོད་སྤྲིན་དྲ་བ་རྒྱ་ཆེན་བཟང་པོ་རབ་བཏོན་ནས།
en: Which emitted excellent, vast networks of clouds of light,

source: །ནོར་བཟངས་སྤྱི་བོར་བཞག་སྟེ་སེམས་ཅན་རྣམ་དག་པ།
en: And placing it upon Sudhana’s head, that pure being,

source: །སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཁས་པས་ཚིག་འདི་སྨྲས།
en: The wise one Avalokiteśvara, spoke these words:

source: །སངས་རྒྱས་སྲས་བོ་ང་ནི་རྣམ་ཐར་གཅིག་སྒོ་ཤེས།
en: “Son of the buddhas, I know one gateway to liberation,

source: །ཡེ་ཤེས་སྙིང་པོ་རྒྱལ་བ་ཀུན་གྱི་ཐུགས་རྗེ་སྡུག །འགྲོ་བ་ཐམས་ཅད་བསྐྱབ་ཅིང་ཡོངས་སུ་བསྡུ་ཕྱིར་བྱུང་།
en: Which is the mass of compassion, the essence of wisdom of all the jinas, Which arises in order to gather and liberate all beings,

source: །ཀུན་ཏུ་བདག་ཉིད་རང་ལ་བྱམས་པ་བཞིན་དུ་རྒྱུ།
en: And my love for them thus courses everywhere.

source: །འགྲོ་བ་མང་པོ་ཐམས་ཅད་སྡུག་བསྔལ་ཀུན་ལས་སྐྱོབ།
en: “I protect all beings from every suffering.

source: །གང་རྣམས་དམ་དུ་བཅིངས་ཤིང་དགྲ་ལག་ཕྱིན་པ་དང་། །ལུས་ལ་གཟེར་ཅིང་དེ་བཞིན་བཙོན་རར་བཙུད་པ་ཡང་།
en: Those who are tightly bound, who are in the hands of enemies, Whose bodies are struck, and who are put into prisons

source: །ང་ཡི་མིང་ཐོས་བཅིངས་ཤིང་བཟུང་བ་ཐར་བར་འགྱུར།
en: On hearing my name are freed from bondage.

source: །རྒྱལ་པོ་དག་ལ་ཉེས་པའི་གཡོན་བྱས་གསད་སྤངས་པ།
en: “Those who have broken the law will escape execution

source: །དེ་ཚེ་དེ་དག་ང་ཡི་མིང་ཡང་དྲན་གྱུར་ན།
en: When at that time they remember my name.

source: །མདའ་འཕངས་དེ་ཡི་ལུས་ལ་ཕོག་པར་མི་འགྱུར་ཏེ།
en: Arrows that are fired will not hit their bodies.

source: །མཚོན་རྣོན་བཏབ་ཀྱང་དེ་དག་མི་འཛུག་སྒལ་བར་འགྱུར།
en: Weapons that strike them will be not pierce them. “Those who remember my name will be invincible.

source: །དབང་པོའི་འཁོར་དུ་ཕྱིན་ཀྱང་གང་རྣམས་རྩོད་གྱུར་པ།
en: Though they enter the courts of lords, no matter who disputes with them,

source: །དགྲ་རྣམས་ཀུན་ལས་རྒྱལ་འགྱུར་གྲགས་པ་འཐོབ་པར་འགྱུར།
en: They will be victorious over all adversaries and attain excellence,

source: །གྲགས་དང་གྲོགས་དང་རིགས་དང་ནོར་རྣམས་འཕེལ་བར་འགྱུར། །ང་ཡི་མིང་དྲན་དེ་དག་ཐུབ་པ་མེད་པར་འགྱུར།
en: And their fame, friends, families, and wealth will increase.

source: །གང་གིས་ང་ཡི་མིང་ནི་རྗེས་སུ་དྲན་བྱས་པ།
en: “Anyone who remembers my name

source: །དེ་དག་རྐུན་པོས་འཇིགས་དོགས་དགྲས་འཇིགས་ནགས་ཕྱིན་ཏེ།
en: Entering forests fearful with thieves, fearful with enemies,

source: །སེང་གེ་དོམ་གཟིག་གཅན་ཟན་གཡག་རྒོད་སྦྲུལ་གང་ཡང་།
en: With lions, bears, leopards, wild beasts, yaks, and snakes,

source: །དགྲ་རྣམས་ཀུན་ལས་རྒྱལ་ཞིང་འཇིགས་པ་མེད་པར་འགྱུར།
en: Will be free of fear and victorious over enemies.

source: །གང་རྣམས་ལ་ལས་ང་ཡི་མིང་ཞིག་དྲན་བྱས་ན།
en: “When anyone who remembers my name

source: །སྡང་བའི་སེམས་ཀྱིས་རིན་ཆེན་ལྟོངསསུ་བོར་གྱུར་ཏམ།
en: Is malevolently thrown from the summit of a great mountain

source: །སོལ་མདག་ལྕི་མེ་རབ་ཏུ་འབར་བར་བོར་གྱུར་ཀྱང་།
en: Or hurled into a blazing fire of coals,

source: །མེ་རྣམས་པད་མོས་གང་བའི་ཆུ་ཡི་གཏེར་དུ་འགྱུར།
en: The fire will transform into a treasure of water filled with lotuses.

source: །ང་ཡི་མིང་ནི་སྐད་འགའ་ཡུད་ཙམ་རྗེས་དྲན་ན།
en: “Anyone who instantly remembers my name

source: །རྒྱ་མཚོའི་ཆུར་བོར་དེ་ཡི་ནང་དུ་འཆི་མི་འགྱུར།
en: When thrown into the sea will not die there.

source: །ཆུ་བོས་མི་འཁྱེར་མེ་ཡི་དབུས་སུ་ཚིག་མི་འགྱུར།
en: They will not be swept away by rivers or burn in the midst of fire.

source: །དོན་མེད་ཀུན་ཏུ་མི་འགྱུར་དོན་རྣམས་འགྲུབ་པར་འགྱུར། །ཤིང་སྒྲོག་དབྱིག་ཆིངས་ལྕགས་སྒྲོག་དེ་བཞིན་ལྟུང་རྣམས་དང་། །བརྙས་ཤིང་ཁྱད་བསད་དེ་བཞིན་བྲིད་ཅིང་བསླུས་པ་དང་། །སྤྱོས་ཤིང་བསྡིགས་ཏེ་གཤེ་དང་སྨ་ཕབ་རྣམ་པ་ལས།
en: In everything they will not fail but will be successful.

source: །ང་ཡི་མིང་ཙམ་དྲན་པར་བྱས་ན་ཐར་པ་ཐོབ།
en: “Those who remember my name will attain liberation From stocks, chains, manacles, and unjust punishments; Dishonor, disrespect, constraints, and deception; Abuse, beatings, threats, and scolding. “All those who are hostile and seek to harm,

source: །གང་རྣམས་ཤར་གཉེར་སྣ་ཚོགས་གླགས་ལྟ་ཇི་སྙེད་དང་། །གང་རྣམས་རྟག་ཏུ་ཞེ་སྡང་མི་སྙན་བརྗོད་པའི་རྣམས།
en: Who are always angry and speak unpleasant words, Will become friendly the moment they see

source: །ང་ཡི་མིང་ཐོས་དྲན་བྱས་སྙན་པར་བརྗོད་པར་འགྱུར། །མཐོང་བ་ཙམ་གིས་མོད་ལ་བྱམས་པའི་སེམས་ཀྱང་སྐྱེ།
en: Those who have heard and remember my name and will praise them.

source: །ང་ཡི་མིང་ཙམ་ལ་ལ་གང་གིས་དྲན་བྱས་ནས། །གནོད་པའི་དོན་དུ་རོ་ལངས་སྔགས་དང་བྱད་བྱེད་པའི།
en: “Anyone who remembers my name

source: །དགྲ་རྣམས་རྟག་ཏུ་དེ་ཡི་ཟིལ་གྱིས་ནོན་པར་འགྱུར།
en: Will always overpower those enemies Who, in order to harm, practice vetāla mantras and sorcery,

source: །མ་ལུས་དུག་གིས་དེ་ཡི་ལུས་ལ་མི་ཚུགས་སོ།
en: And they will not be harmed by any poison.

source: །ལ་ལ་གང་གིས་ང་ཡི་མིང་ཙམ་དྲན་བྱས་ན།
en: “Those who have remembered my name will pacify

source: །ཀླུ་དབང་སྲིན་ཚོགས་མཁའ་ལྡིང་ཤ་ཟ་ཐམས་ཅད་དང་། །གྲུལ་བུམ་སྲུལ་པོ་འཚེ་བྱེད་གཏུམ་པོའི་སེམས་དང་ལྡན།
en: All nāga lords, hordes of rākṣasas, garuḍas, piśācas, Kumbhāndas, and pūtanas who with wrathful minds cause harm,

source: །མདངས་འཕྲོག་འཇིགས་བྱེད་རྨི་ལམ་འོང་བའང་ཞི་བར་འགྱུར།
en: Who steal vitality, and who terrify in dreams.

source: །ང་ཡི་མིང་ནི་སྐད་ཅིག་ཡུད་ཙམ་དྲན་བྱས་ཀྱང་།
en: “Those who remember my name for a moment

source: །ཕ་དང་མ་དང་གཉེན་བཤེས་མཛའ་བ་ཀུན་དང་ཡང་།
en: Will not become separated from parents, friends, and relatives,

source: །འབྲལ་བར་མི་འགྱུར་སྡང་དང་འགྲོགས་པར་དེ་བཞིན་མིན།
en: And will not be in the company of those who dislike them;

source: །ནོར་ཟད་མི་འགྱུར་ཕོངས་པའི་དངོས་སུ་མི་འགྱུར་རོ།
en: Their wealth will not be exhausted, and they will not become poor.

source: །ང་ཡི་མིང་གི་རྗེས་སུ་ལ་ལ་དྲན་བྱེད་ན།
en: “Anyone who remembers my name

source: །འདི་ནས་ཤི་འཕོས་མནར་མེད་སེམས་དམྱལ་མི་འགྲོ་སྟེ།
en: Will not go to the Avīci hell when they die But will be reborn as a good being, a deva or human,

source: །བྱོལ་སོང་སྐྱེ་གནས་ཡི་དགས་མི་ཁོམ་གནས་སུ་མིན། །སེམས་ཅན་དག་ལ་ལྷ་དང་མི་ཡི་གནས་སུ་སྐྱེ།
en: And not as an animal or a preta, or in an unfortunate existence.

source: །ང་ཡི་མིང་ནི་ལ་ལ་གང་གིས་དྲན་བྱས་ན།
en: “Those who remember my name will become humans

source: །དམུས་ལོང་ཞར་བ་འོན་པ་ཞ་བོར་མི་འགྱུར་ཏེ།
en: Who are not blind, one-eyed, deaf, unable to walk,

source: །འཐེང་པོ་ལོང་བར་མི་འགྱུར་གསལ་སྨྲ་བལྟ་སྡུག་འགྱུར།
en: Or with a limp, but who speak clearly and have a pleasant appearance,

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་དབང་པོར་ཀུན་ལྡན་འགྱུར།
en: And they will possess all faculties for many millions of kalpas.

source: །ལ་ལ་གང་གིས་ང་ཡི་མྱིང་ནི་རྗེས་དྲན་ན།
en: “Anyone who remembers my name

source: །སེམས་ཅན་དག་པ་འདི་ནས་ཤི་འཕོས་ཕྱོགས་བཅུ་ཡི།
en: Will be a pure being who on passing away will be reborn

source: །འཇིག་རྟེན་ཁམས་སུ་སངས་རྒྱས་མངོན་སུམ་སྐྱེ་བར་འགྱུར།
en: In the presence of buddhas in world realms in the ten directions,

source: །སངས་རྒྱས་མཐོང་འགྱུར་དེ་དག་ཆོས་ཀྱང་ཐོས་པར་འགྱུར།
en: Will see the buddhas, and will hear their Dharma.

source: །འདི་དང་དེ་བཞིན་གཞན་དག་ཐབས་མང་ཇི་སྙེད་ཀྱིས།
en: “These and all my many other methods

source: །འགྲོ་བར་སེམས་ཅན་ང་འདུལ་གཞལ་དང་ཟད་མི་ནུས།
en: For guiding beings in worlds are endless and innumerable.

source: །སངས་རྒྱས་སྲས་པོ་ངས་ནི་རྣམ་ཐར་གཅིག་བསྒོམས་ཏེ།
en: Son of the buddhas, I meditate on this one liberation,

source: །ཡོན་ཏན་ཅན་གྱི་ཡོན་ཏན་ཐམས་ཅད་ངས་མི་ཤེས།
en: But I do not know all the qualities of those with qualities.”

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་ཞེས་བྱ་བ་ཤར་ཕྱོགས་ནས་ནམ་མཁའི་དབྱིངས་ལས་འོངས་ཏེ། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་ཡུག་གི་རྩེ་མོར་འདུག་གོ །བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བས།
en: At that time the bodhisattva Ananyagāmin came from the east through the sky and resided on a peak of the Cakravāla mountain range in the Sahā world realm.

source: མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་ཡུག་གི་རྩེ་མོ་ལ་རྐང་པ་གཉིས་བོར་མ་ཐག་དུ། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། རིན་པོ་ཆེ་དུ་མའི་རང་བཞིན་དུ་ཀུན་ནས་གནས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མྱི་འགྲོ་བ་དེས།
en: The moment that the bodhisattva Ananyagāmin’s feet landed on a peak of the Cakravāla mountain range in the Sahā world realm, the Sahā world realm shook in six ways and transformed into being composed of many jewels.

source: ཉི་མ་དང་ཟླ་བའི་འོད་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པ་དང་། ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་དང་། མེ་དང་རིན་པོ་ཆེ་དང་། གློག་དང་། སྐར་མའི་འོད་ཀྱང་ཟིལ་གྱིས་ནོན་པ་དེ་ལྟ་བུའི་འོད་ལུས་ལས་བཀྱེ་སྟེ།
en: The bodhisattva Ananyagāmin outshone the light of the sun and moon. The light from his body outshone devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, the world guardians, fire, jewels, lightning, and starlight.

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དག་ཀྱང་སྣང་བར་བྱས།
en: He even illuminated the great hells.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐིབས་པོ་ཐམས་ཅད་ཀྱང་སྣང་བར་བྱས་ཏེ།
en: He illuminated all dark existences in the realm of animals and the world of Yama.

source: ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱང་དེ་མ་ཐག་ཏུ་ཞིའོ།
en: He caused all the sufferings in the lower existences to instantly cease.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཡང་ཉམས་སུ་མི་གནོད་པར་གྱུར་ཏོ།
en: All beings ceased to be tormented by the kleśas.

source: །མྱ་ངན་གྱི་ཟུག་རྔུ་དང་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱང་རྩེ་ཟིལ་བར་གྱུར་ཏོ།
en: Various kinds of misery, pain, and suffering were alleviated.
